Repository: mozilla-l10n/mt-training-data
Catalog: mg/mg_pontoon.tmx
Source language: en_us
Languages: mg

source: 1 Review
mg: Fitsarana {numReviews}

source: Action
mg: Tao

source: Action Game
mg: Lalao Tao

source: Add-ons
mg: Fanampy

source: Adults Only 18+
mg: Olon-dehibe Ihany 18+

source: Adventure
mg: Kisendrasendra

source: Adventure Game
mg: Lalao Kisendrasendra

source: all content
mg: atiny rehetra

source: All games
mg: Lalao rehetra

source: All Platforms
mg: Platifaorima Rehetra

source: Android Mobile
mg: Finday Android

source: Android Tablet
mg: Tabilety Android

source: An error occurred.
mg: Nisy olana nitranga.

source: An internal server error occurred. Please try again later.
mg: Nisy tsy feteza-mpizara anatiny. Andramo indray rehefa avy eo azafady.

source: An update to Marketplace is available.
mg: Misy fanavaozana ny Tsena vonona.

source: App Detail
mg: Antsipirian'ny App

source: App for Albania
mg: Ireo app ho an'i Albania

source: App for Argentina
mg: App ho an'i Arzentina

source: App for Bangladesh
mg: App ho an'i Bengladesy

source: App for Brazil
mg: Ireo app ho an'i Brezily

source: App for Bulgaria
mg: App ho an'i Biolgaria

source: App for Chile
mg: Ireo app ho an'i Silia

source: App for China
mg: App ho an'i Sina

source: App for Colombia
mg: Ireo app ho an'i Kolombia

source: App for Costa Rica
mg: Ireo app ho an'i Costa Rica

source: App for Croatia
mg: App ho an'i Kroasia

source: App for Czech Republic
mg: Ireo app ho an'ny Repoblika Tseky

source: App for Ecuador
mg: App ho an'i Ekoatera

source: App for El Salvador
mg: Ireo app ho an'i El Salvador

source: App for France
mg: App ho an'i Frantsa

source: App for Germany
mg: App ho an'i Alemaina

source: App for Greece
mg: App ho an'i Gresy

source: App for Hungary
mg: Ireo app ho an'i Hongria

source: App for India
mg: Ireo app ho an'i India

source: App for Italy
mg: App ho an'i Italia

source: App for Japan
mg: App ho an'i Japana

source: App for Macedonia
mg: App ho an'i Masedonia

source: App for Mexico
mg: Ireo app ho an'i Meksika

source: App for Montenegro
mg: App ho an'i Montenegro

source: App for Nicaragua
mg: Ireo app ho an'i Nikaragoà

source: App for Panama
mg: App ho an'i Panama

source: App for Peru
mg: App ho an'i Peroa

source: App for Poland
mg: App ho an'i Polona

source: App for Russia
mg: App ho an'i Rosia

source: App for Serbia
mg: Ireo app ho an'i Serbia

source: App for South Africa
mg: Ireo app ho an'i Afrika Atsimo

source: App for Spain
mg: App ho an'i Espaina

source: App for Uruguay
mg: Ireo app ho an'i Iorogoay

source: App for Venezuela
mg: App ho an'i Venezoela

source: App install error: {error}
mg: Olana momba fametrahana app: {error}

source: {app_name} screenshot
mg: Sarin'efijerin'i {app_name}

source: App not yet reviewed
mg: App tsy mbola voatsara

source: App Review
mg: Fitsarana App

source: Approve / Reject
mg: Hanaiky / Handà

source: apps
mg: app

source: Apps
mg: App

source: App Statistics
mg: Antontanisan'ny App

source: App usage statistics
mg: Antontanisan'ny fampiasana app

source: Arts & Entertainment App
mg: Appn'ny Zavakanto & Fialamboly

source: Back to app
mg: Hiverina @ app

source: Back to {app}
mg: Hiverina @ {app}

source: <b>{n}</b> Result
mg: Vokany <b>{n}</b>

source: Books & Comics
mg: Boky & BD

source: <b>"{search_query}"</b> returned {n} result
mg: <b>"{search_query}"</b> namoaka vokany {n}

source: Business
mg: Bizina

source: Cancel
mg: Foanana

source: Categories
mg: Sokajy

source: Category
mg: Sokajy

source: Collection Detail
mg: Antsipirian'ny Firaketana

source: Compatibility
mg: Fifanentanana

source: Content Not Found
mg: Atiny Tsy Hita

source: Content Rating
mg: Naotin'ny Atiny

source: Currently Offline
mg: Tsy an-jotra izao

source: {current} of {count}
mg: {current} @ {count}

source: Customize your device with powerful features.
mg: Atokano @ alàlan'ny fiasa matanjaka ny fitaovanao.

source: Delete
mg: Hamafa

source: Describe the issue here. Please be specific.
mg: Soritsorito eto ilay olana. Farito mazava tsara azafady.

source: Description
mg: Fanoritsoritana

source: Desktop
mg: Solosaim-birao

source: Develop Apps
mg: Hamolavola App

source: Developer
mg: Mpamolavola

source: Developer Listing
mg: Lisitry ny Mpamolavola

source: Develop Firefox OS Add-ons
mg: Hamolavola Fanampy Firefox OS

source: Display as
mg: Haseho toa

source: Display Name
mg: Anarana Isehoana

source: Download
mg: Hampidina

source: Edit
mg: Hanitsy

source: Edit Listing
mg: Hanitsy Lisitra

source: Edit Review
mg: Hanitsy Fitsarana

source: Edit your review
mg: Hanitsy ny fitsaranao

source: Edit your Review
mg: Hanitsy ny Fitsaranao

source: Education
mg: Fampianarana

source: Email
mg: Mailaka

source: Email Address
mg: Adiresy Mailaka

source: Email Support
mg: Fanampiana @ Mailaka

source: English
mg: Anglisy

source: Enjoy instant fun with our handpicked selection of desktop web games you can play right in your browser.
mg: Ankafizo ny fahafinaretana eo noho eo miaraka @ fantina nofidin-tànana @ ireo lalao web am-birao azonao lalaovina mivantana eo @ mpitety tranonkalanao.

source: Entertainment
mg: Fialamboly

source: Error while communicating with server. Try again later.
mg: Olana tsy nahatafaray @ mpizara. Andramo indray rehefa avy eo.

source: Everyone
mg: Tsirairay

source: Everyone 10+
mg: Tsirairay 10+

source: Examples of issues to report here are if the app is broken, contains mature content, contains malware, etc. The app developer will not see your comments.
mg: Anisan'ireo olana taterina eto ohatra raha toa ilay app ka simba, misy atiny natao ho an'ny anti-panahy, misy rindrambaiko mpisompatra, sns. Tsy hahita ny tatitrao ny mpamolavola ilay app.

source: Except where otherwise <a href="{legal_url}" target="_blank">noted</a>, content on this site is licensed under the <a href="{cc_url}" target="_blank">Creative Commons Attribution Share-Alike License v3.0</a> or any later version.
mg: Raha tsy hoe misy <a href="{legal_url}" target="_blank">fanamarihana</a> mifanohitra amin'ny voalaza, ny atiny ato amin'ity tranonkala ity dia misy fahazoan-dàlana araka ny <a href="{cc_url}" target="_blank">Fahazoan-dàlana Creative Commons Attribution Share-Alike v3.0</a> na ny kinova aoriany.

source: Expand
mg: Hamelatra

source: Explore more in {category}.
mg: Miteteza bebe kokoa ao @ {category}.

source: Explore more in {category_one} and {category_two}.
mg: Miteteza bebe kokoa ao @ {category_one} sy {category_two}.

source: Featured Book App
mg: Appn'ny Boky Asongadina

source: Featured Creativity App
mg: Ireo Appn'ny Famoronana Asongadina

source: Featured Education App
mg: Ireo Appn'ny Fampianarana Asongadina

source: Featured Game
mg: Lalao Asongadina

source: Featured Lifestyle App
mg: Ireo Appn'ny Fomba Fiainana Asongadina

source: Featured Music App
mg: Ireo Appn'ny Mozika Asongadina

source: Featured Shopping App
mg: Appn'ny Fiantsenana Asongadina

source: Featured Social App
mg: Ireo Appn'ny Sosialy Asongadina

source: Featured Sports App
mg: Appn'ny Fanatanjahantena Asongadina

source: Featured Travel App
mg: Ireo Appn'ny Dia Asongadina

source: Feedback
mg: Tsikera

source: Feedback submitted. Thanks!
mg: Lasa ny tsikera. Misaotra!

source: File Size
mg: Haben'ny Rakitra

source: Find more great games
mg: Hitady lalao mahafinaritra misimisy

source: Firefox OS Add-ons
mg: Fanampy Firefox OS

source: Flagged for review
mg: Voamarika hotsaraina

source: Flagging review...
mg: Manamarika fitsarana…

source: Flag Review
mg: Hanamarika Fitsarana

source: Food & Drink
mg: Sakafo & Zava-pisotro

source: For ages {0}+
mg: Ho an'ny taona {0}+

source: For all ages
mg: Ho an'ny taona rehetra

source: For information on show to report a copyright or trademark issue <a href="{url}" target="_blank">see here</a>.
mg: Raha mila fampahalalana momba ny seho hitaterana olana momba ny zon'ny mpamorona na mari-barotra, dia <a href="{url}" target="_blank">jereo ato</a>.

source: For previous version {version}
mg: Ho an'ny kinova {version} teo aloha

source: free
mg: maimaim-poana

source: Free
mg: Maimaim-poana

source: Free Carrier Apps
mg: App Maimaim-poana avy @ Mpandraharaha

source: French
mg: Frantsay

source: Game
mg: Lalao

source: Games
mg: Lalao

source: Games & Entertainment Apps—Desktop Essentials
mg: Ireo Appn'ny Lalao & Fialamboly—Ilaina @ Birao

source: General settings
mg: Tefy ankapobe

source: Generic
mg: Faobe

source: German
mg: Alemà

source: Get Firefox News.
mg: Mahazoa Vaovaon'i Firefox.

source: Get Firefox news! Sign up for our newsletter
mg: Mahazoa vaovaon'i Firefox! Misorata @ taratasim-baovaonay

source: Get Help
mg: Hila Fanampiana

source: Get Involved
mg: Handray anjara

source: Get them now!
mg: Araraoty izao ireo!

source: Give us your feedback. Let us know whether we are awesome or buggy.
mg: Lazao anay ny tsikeranao. Mba ampahafantaro anay raha mahagaga izahay na be tsiny.

source: Groundbreaking App
mg: App Mpisava Làlana

source: Health & Fitness
mg: Fahasalamana & Fitazaim-batana

source: Health & Fitness App
mg: Appn'ny Fahasalamana & Fitaizam-batana

source: Hidden Gem
mg: Vatosoa Miafina

source: Home
mg: Trano

source: Homepage
mg: Pejy trano

source: Homescreens
mg: Efijery Trano

source: Humor
mg: Hatsikana

source: Hungarian
mg: Hongoroanina

source: I'm okay with Mozilla handling my info as explained in <a href="{privacy_policy_url}" target="_blank">this Privacy Policy</a>.
mg: Ekeko ny hikirakiran'i Mozilla ny fampahalalana momba ahy araka ny nohazavaina ao @ <a href="{privacy_policy_url}" target="_blank">ity Politika Fiarovana Tsiambaratelo ity</a>.

source: Inappropriate language/dialog
mg: Fiteny/dialog tsy mendrika

source: Indonesian
mg: Indonezianina

source: Install
mg: Hametraka

source: Install add-on
mg: Hametraka fanampy

source: Install Add-on
mg: Hametraka Fanampy

source: Installed
mg: Tafapetraka

source: Installed!
mg: Tafapetraka!

source: Install failed. Please try again later.
mg: Tsy tafapetraka. Andramo indray rehefa avy eo azafady.

source: Install for free
mg: Hametraka maimaim-poana

source: Install for {price}
mg: Hametraka @ {price}

source: Install now!
mg: Apetraho izao!

source: Internet
mg: Aterineto

source: Is there something wrong or out-of-date with this website listing?
mg: Moa ve misy zavatra tsy mety na lany daty @ ity lisitra an-tranonkala ity?

source: Kids
mg: Ankizy

source: Language Packs
mg: Paken-teny

source: Last updated
mg: Nohavaozina farany

source: last updated: {date}
mg: nohavaozina farany: {date}

source: Launch this app from your <b>Applications</b> directory.
mg: Alefaso avy ao @ rejisitrao <b>Rindranasa</b> io app io.

source: Launch this app from your <b>dash</b>, <b>Application picker</b>, or <b>Applications menu</b>.
mg: Alefaso avy @ <b>takelaka fanamoriana</b>, <b>Mpisafidy rindranasa</b>, na <b>menio Rindranasa</b>.

source: Launch this app from your <b>Windows desktop</b> or <b>Start &#9658; All Programs</b>.
mg: Alefaso avy ao @ <b>birao Windows</b> anao na <b>Hanomboka &#9658; Rindrandamina Rehetra</b>.

source: Learn how to change them.
mg: Ianaro ny fomba fanovana azy ireo.

source: Learn more about why games and Mozilla go so well together.
mg: Fantaro bebe kokoa nahoana no mety miaraka tsara ny lalao sy i Mozilla.

source: Leave a Review
mg: Hametraka Fitsarana

source: Let us know...
mg: Mba ampahafantaro anay...

source: Let us know if something is missing from this website listing or its information should be updated.
mg: Mba ampahafantaro anay raha misy zavatra tsy ao amin'ity lisitra an-tranonkala ity na raha tokony hohavaozina ny fampahalalana ao.

source: Let us know if this app is doing something that isn't allowed in the <a href="{criteria_url}">review criteria</a> and should be removed from the Marketplace.
mg: Mba ampahafantaro anay raha manao zavatra tsy azo atao voalaza ao @ <a href="{criteria_url}">fepetran'ny fitsarana</a> ity app ity ka tokony hesorina tao @ Tsena.

source: Lifestyle
mg: Fomba Fiainana

source: Loading...
mg: Mamatratra…

source: Loading Privacy Policy...
mg: Mamatratra Politika Fiarovana Tsiambaratelo…

source: Load more
mg: Hamatratra bebe kokoa

source: Local Favorite App
mg: App Tiana Eo An-toerana

source: Lookup Tool
mg: Fitaovana Fitadiavana

source: Manage projects easily with Basecamp.
mg: Handrindra tetikasa @ fomba mora @ Basecamp.

source: Maps & Navigation
mg: Sarintany & Fitetezana

source: Maps & Navigation App
mg: Appn'ny Sarintany & Fitetezana

source: Mature 17+
mg: Anti-panahy 17+

source: Misplaced bug report or support request
mg: Tatitra tsininy na fangatahana fanampiana diso toerana

source: More
mg: Bebe kokoa

source: More Information
mg: Fampahalalana Bebe Kokoa

source: More to Explore
mg: Bebe kokoa Hotetezina

source: Most Recent Version
mg: Kinova Vao Haingana Indrindra

source: Music
mg: Mozika

source: My Apps
mg: Ireo Appko

source: Mystery App!
mg: Appn'ny Misitery!

source: My Submissions
mg: Ireo Narotsako

source: Need to report something?
mg: Te-hitatitra zavatra?

source: New
mg: Vaovao

source: New Apps
mg: App Vaovao

source: News
mg: Vaovao

source: New Sites
mg: Tranonkala Vaovao

source: Newsletter
mg: Taratasim-baovao

source: Newsletter Signup
mg: Fisoratana @ Taratasim-baovao

source: News & Weather App
mg: Ireo Appn'ny Vaovao & Toetrandro

source: Next
mg: Manaraka

source: No apps found.
mg: Tsisy app hita.

source: No Firefox OS add-ons found.
mg: Tsisy fanampy Firefox OS hita.

source: No language packs found.
mg: Tsisy paken-teny hita.

source: No results found
mg: Tsisy vokany hita

source: No results found, try again later
mg: Tsisy vokany hita, andramo indray rehefa avy eo

source: not available for your platform
mg: tsy misy ho an'ny platifaorimanao

source: not available for your region
mg: tsy misy ho an'ny faritra misy anao

source: Not enough statistics to show.
mg: Tsisy antontanisa ampy haseho.

source: Not yet reviewed
mg: Tsy mbola voatsara

source: {n} star
mg: Kintana {n}

source: Oh no!
mg: Adray!

source: Only users that are logged in may submit reviews.
mg: Ireo mpampiasa tafiditra ihany no afaka mandrotsaka fitsarana.

source: Open
mg: Hanokatra

source: Open app
mg: Hanokatra app

source: Open website
mg: Hanokatra tranonkala

source: Payment cancelled.
mg: Nofoanana ny fandoavam-bola.

source: Payment failed. Try again later.
mg: Tsy nety ny fandoavam-bola. Andramo indray rehefa avy eo.

source: Personalization
mg: Fanokanana

source: Photo & Video
mg: Sary & Horonantsary

source: Photo & Video App
mg: Appn'ny Sary & Horonantsary

source: Play 45 creative variations of chess.
mg: Milalaova fiovaovana ahaiza-mamorona 45 @ échecs.

source: Play GoldNuggets now!
mg: Milalaova GoldNuggets izao!

source: Play now!
mg: Milalaova izao!

source: Please read the <a href="{url}" target="_blank">Review Guidelines</a> for more details about rating apps. Reviews that do not meet these guidelines may be removed by our moderation team without notice.
mg: Azafady vakio ireo <a href="{url}" target="_blank">Torolàlana momba ny Fitsarana</a> raha mila antsipiriany bebe kokoa momba ny fanomeza-naoty ireo app. Ireo fitsarana tsy manaja an'ireo torolàlana ireo dia mety hesorin'ny ekipa mpametra onony tsy misy filazana.

source: Please select a star rating.
mg: Mifantena naoty kintana azafady.

source: Please set today's date and time in your device settings to access the Marketplace.
mg: Azafady tefeo @ tefin'ny fitaovanao ny daty sy ora anio ao raha hiditra ao @ Tsena.

source: Please sign in to view the receipt
mg: Azafady midira raha hijery ilay rosia

source: Polish
mg: Poloney

source: Popular
mg: Malaza

source: Popular Apps
mg: App Malaza

source: Popular Homescreens
mg: Efijery Trano Malaza

source: Popular Sites
mg: Tranonkala Malaza

source: Portuguese
mg: Portigey

source: Premium version available
mg: Misy kinova avo lenta

source: Previous
mg: Teo aloha

source: Privacy Policy
mg: Politika Fiarovana Tsiambaratelo

source: Productivity
mg: Fahafaha-mamokatra

source: Productivity Apps—Desktop Essentials
mg: Ireo Appn'ny Fahafaha-mamokatra—Ilaina @ Birao

source: Puzzle
mg: Ankamantatra

source: Puzzle Game
mg: Lalao Ankamantatra

source: Rate:
mg: Naoty:

source: Rated {stars} out of {maxstars} stars
mg: Nomena naoty {stars} amin'ny kintana {maxstars}

source: Rating Details
mg: Antsipirian'ny Naoty

source: Rating Pending
mg: Naoty Miandry

source: Rating Refused
mg: Naoty Nolavina

source: Read all reviews
mg: Hamaky ny fitsarana rehetra

source: Read All Reviews
mg: Hamaky Fitsarana Rehetra

source: Receipt
mg: Rosia

source: Recommendations
mg: Torohevitra

source: Recommended
mg: Natoro

source: Recommended Apps
mg: App Atoro

source: Region
mg: Faritra

source: Register
mg: Hisoratra

source: Report
mg: Hitatitra

source: Report Abuse
mg: Hitatitra Fanararaotana

source: Report an issue
mg: Hitatitra olana

source: Report an Issue
mg: Hitatitra Olana

source: Report submitted. Thanks!
mg: Lasa ny tatitra. Misaotra!

source: Report Trademark Abuse
mg: Hitatitra Fanararaotana Mari-barotra

source: Review
mg: Fitsarana

source: Reviewer Tools
mg: Fitaovan'ny Mpitsara

source: Review History
mg: Tantaran'ny Fitsarana

source: Reviews
mg: Fitsarana

source: Russian
mg: Rosianina

source: Save Changes
mg: Hitahiry Fanovana

source: Science & Tech
mg: Siansa & Haitao

source: Search
mg: Hikaroka

source: Search Marketplace&hellip;
mg: Hikaroka ao @ Tsena&hellip;

source: Search Results
mg: Vokatry ny Fikarohana

source: See an issue with this review? Select a reason below.
mg: Mahita olana amin'ity fitsarana ity? Mifantena antony eto ambany.

source: Settings
mg: Tefy

source: Settings could not be saved
mg: Tsy voatahiry ireo tefy

source: Shopping
mg: Fiantsenana

source: Show me another site
mg: Asehoy tranonkala hafa aho

source: Show me everything for <mkt-selected-text></mkt-selected-text>
mg: Asehoy ahy izay rehetra momba ny <mkt-selected-text></mkt-selected-text>

source: Show <mkt-selected-text></mkt-selected-text>
mg: Hampiseho ny <mkt-selected-text></mkt-selected-text>

source: Sign in
mg: Hiditra

source: Sign In
mg: Hiditra

source: Sign in to review
mg: Hiditra hitsara

source: Sign me up
mg: Soraty ao aho

source: Sign out
mg: Hivoaka

source: Sign Out
mg: Hivoaka

source: Sign up for our newsletter
mg: Misorata @ taratasim-baovaonay

source: Sign up for our newsletter.
mg: Misorata @ taratasim-baovaonay.

source: Sites
mg: Tranonkala

source: size: {size}
mg: habe: {size}

source: Social
mg: Sosialy

source: Sorry, there was an error posting your review. Please try again later.
mg: Miala tsiny fa nisy olana tsy nahalasa ny fitsaranao. Andramo indray rehefa avy eo azafady.

source: Sorry, there was an issue editing your review. Please try again later
mg: Miala tsiny fa nisy olana tsy nahavoahitsy ny fitsaranao. Andramo indray rehefa avy eo azafady

source: Sorry, there was an issue flagging the review. Please try again later.
mg: Miala tsiny fa nisy olana tsy nahavoamarika ilay fitsarana. Andramo indray rehefa avy eo azafady.

source: Sorry, there was a problem deleting the review
mg: Miala tsiny fa nisy olana tsy nahavoafafa ny fitsarana

source: Sorry, we had trouble fetching this app's data. Please try again later.
mg: Miala tsiny fa tojo olana tsy nahazoana ny datan'io app io izahay. Andramo indray rehefa avy eo azafady.

source: Sorry, you are currently offline. Please try again later.
mg: Miala tsiny fa tsy an-jotra ianao izao. Andramo indray rehefa avy eo azafady.

source: Sorry, you need to be online to access the Marketplace.
mg: Miala tsiny fa mila an-jotra ianao raha hiditra ao @ Tsena.

source: Sorry, your device clock appears to be set incorrectly.
mg: Miala tsiny fa toa tsy mety ny nanefena ny famantaranandron'ny fitaovanao.

source: Spam or otherwise non-review content
mg: Spama na atiny tsy fitsarana hafa

source: <span>by</span> {author}
mg: <span>nataon'i</span> {author}

source: Spanish
mg: Espaniola

source: Sports
mg: Fanatanjahantena

source: Statistics
mg: Antontanisa

source: Strategy
mg: Paikady

source: Strategy Game
mg: Lalao Paikady

source: Submit Feedback
mg: Handefa Tsikera

source: Submit Report
mg: Handefa Tatitra

source: Submit Review
mg: Handrotsaka Fitsarana

source: Support
mg: Fanampiana

source: Support Site
mg: Tranonkala Fanampiana

source: System Date Incorrect
mg: Diso ny Datin'ny Rafitra

source: Teen
mg: Adolantsento

source: Tell us what you like about this app. Write like you’re telling a friend about your experience with the app. Give specific details, for example, What features did you like or dislike?
mg: Lazao anay izay tianao momba an'ity app ity. Soraty toy ny mitantara @ namanao ny traikefanao amin'ilay app. Manomeza antsipiriany voafaritra mazava, ohatra hoe fiasa inona no tianao na tsy tianao?

source: Terms of Use
mg: Fepetra Fampiasana

source: Thanks for signing up!
mg: Misaotra anao nisoratra!

source: Thank you for purchasing
mg: Misaotra anao nividy

source: The category you requested does not exist.
mg: Tsy misy ilay sokajy angatahinao.

source: The list returned no results.
mg: Tsisy vokany navoaky ny lisitra.

source: The next time you start the Firefox Marketplace app, you’ll see the updated version!
mg: Rehefa mamelona ny app Tsena Firefox ianao @ manaraka, dia hahita ilay kinova nohavaozina!

source: There was an error submitting your newsletter sign up request
mg: Nisy olana tsy nahalasa ny fangatahanao hisoratra anarana @ taratasim-baovao

source: There was an issue submitting your report. Please try again later.
mg: Nisy olana tsy nahalasa ny tatitrao. Andramo indray rehefa avy eo azafady.

source: There was a problem submitting your feedback. Try again soon.
mg: Nisy olana tsy nahalasa ny tsikeranao. Andramo indray rehefa afaka kelikely.

source: This app has no reviews.
mg: Tsy manana fitsarana io app io.

source: This review has been successfully deleted
mg: Voafafa soa aman-tsara io fitsarana io

source: This review has been successfully flagged. Thanks!
mg: Voamarika soa aman-tsara io fitsarana io. Misaotra!

source: Toggle App Previews
mg: Hamadika Topy Maso App

source: Toggle Menu
mg: Hamadika Menio

source: Toggle Search
mg: Hamadika Karoka

source: Toggle Settings Menu
mg: Hamadika Menion'ny Tefy

source: Tool & Time Saver
mg: Fitaovana & Mpitsitsy Fotoana

source: Travel
mg: Dia

source: Try again
mg: Hanandrana indray

source: Try Again
mg: Hanandrana Indray

source: Unable to install packaged apps
mg: Tsy afaka mametraka ireo app anaty pake

source: Unavailable
mg: Tsy vonona

source: Update Review
mg: Hanavao Fitsarana

source: Updates
mg: Fanavaozana

source: Utilities
mg: Serivisim-panjakana

source: version: {version}
mg: kinova: {version}

source: View all
mg: Hijery azy rehetra

source: View All
mg: Hijery Rehetra

source: Visit this top site!
mg: Tsidiho ity tranonkala sangany ity!

source: Weather
mg: Toetrandro

source: Website Detail
mg: Antsipirian'ny Tranonkala

source: websites
mg: tranonkala

source: We want to hear from you!
mg: Te-handre izay hevitrao izahay!

source: Whoops! Something went wrong and you ended up here. Sorry!
mg: Oy! Nisy zavatra tsy nety ka ato no niafaranao. Miala tsiny!

source: Work & Business App
mg: Ireo Appn'ny Asa & Bizina

source: works offline
mg: mandeha tsy an-jotra

source: Write a review
mg: Hanoratra fitsarana

source: Write a Review
mg: Hanoratra Fitsarana

source: Yes, show me recommendations based on my installed apps. <a href="{url}" target="_blank">Learn more</a>
mg: Eny, asehoy torohevitra araka ireo app napetrako aho. <a href="{url}" target="_blank">Hamantatra bebe kokoa</a>

source: You have no apps
mg: Tsy manana app ianao
